// Source: https://github.com/h0ffayyy/MicrosoftSentinelStuff
// Collected: 2026-05-11
// KQL Library - https://github.com/sivolko/kql-library

CommonSecurityLog
| where DeviceVendor == "Palo Alto Networks"
| where Activity == "SYSTEM"
| where DeviceEventClassID == "general"
| where Message endswith "to 8833-8682 by Auto update agent\""