// Source: https://github.com/ep3p/Sentinel_KQL
// Collected: 2026-05-13
// KQL Library - https://github.com/sivolko/kql-library

SecurityEvent
| where EventData has "Malformed Security Descriptor"
| project
    TimeGenerated,
    Account,
    AccountType,
    Computer,
    SubjectLogonId, // Search the 4624 event for this SubjectLogonId
    Activity,
    OperationType,
    EventData