// Source: https://github.com/Azure/ausgovcaf-cloudsoe
// Collected: 2026-05-10
// KQL Hunter - https://github.com/YOUR_USER/kql-hunter

SecurityEvent 
| where EventID == 5451
| extend ed = parse_xml(EventData).EventData.Data
| mv-apply ed on 
(
    where ed['@Name'] == 'EspAuthType'
    | project ESPAuthType = ed['#text']
)
| where ESPAuthType == "-"
| project TimeGenerated, Computer, Activity, ESPAuthType