// Source: https://github.com/ChrFrohn/KQL
// Collected: 2026-05-12
// KQL Library - https://github.com/sivolko/kql-library

SecurityEvent
| where EventID == '5136'
| where AccountType == 'User' 
| summarize by Account