// Source: https://github.com/BrianTJackett/log-analytics-samples
// Collected: 2026-05-17
// KQL Library - https://github.com/sivolko/kql-library

let StartDate = ago(31d);
let OperationFilter = "FileSyncUploadedFull";
let FilePathMatch = ".git";
OfficeActivity
| where TimeGenerated > StartDate
| where Operation == OperationFilter
| where OfficeObjectId contains FilePathMatch
| distinct UserId