// Source: https://github.com/AbhishekPratap9/SOC-Analysis
// Collected: 2026-05-15
// KQL Library - https://github.com/sivolko/kql-library

DeviceEvents
| where Timestamp > ago(7d)
| where ActionType == "AntivirusDetection"
| summarize (Timestamp, ReportId)=arg_max(Timestamp, ReportId), count() by DeviceId
| where count_ > 5