// Source: https://github.com/xpinux/Project-SABER
// Collected: 2026-05-15
// KQL Library - https://github.com/sivolko/kql-library

OfficeActivity | where Operation == "MailboxLogin" | where UserAgent contains "PowerShell" or UserAgent contains "WinRm" or UserAgent contains "RemotePowerShell" or UserAgent contains "python"