// Source: https://github.com/microsoft/AzureMonitorCommunity
// Collected: 2026-05-14
// KQL Library - https://github.com/sivolko/kql-library

SecurityEvent
| where EventID in (4728, 4732, 4756)
| summarize count() by SubjectAccount