// Source: https://github.com/WhalerMike/uiao
// Collected: 2026-05-10
// KQL Hunter - https://github.com/YOUR_USER/kql-hunter

OfficeActivity
| where TimeGenerated > ago(30d)
| where OfficeWorkload in ("PowerApps", "MicrosoftFlow", "PowerBI")
| summarize EventCount = count() by OfficeWorkload, Operation
| order by OfficeWorkload, EventCount desc