// Source: https://github.com/rod-trent/SentinelKQL
// Collected: 2026-05-15
// KQL Library - https://github.com/sivolko/kql-library

let bytes_ = 500;
SecurityEvent
| where TimeGenerated > startofday(ago(1d))
| summarize count() by bin(TimeGenerated, 1m)
| extend EPS = count_ /60
|summarize avg(EPS), estimatedGBytes = (avg(EPS) * bytes_ ) / (1024*1024*1024)
| sort by toint(estimatedGBytes) desc