// Source: https://github.com/chadmcox/Sentinel-and-Defender-Queries
// Collected: 2026-05-17
// KQL Library - https://github.com/sivolko/kql-library

IdentityLogonEvents 
| where FailureReason == "WrongPassword"
| where AccountName !has "$"
| where Application == "Active Directory"
| summarize dailybadpassword =  count() by startofday(Timestamp)
| sort by Timestamp desc 