// Source: https://github.com/ep3p/Sentinel_KQL
// Collected: 2026-05-13
// KQL Library - https://github.com/sivolko/kql-library

SecurityEvent
| where EventData has_any ("CN=Partitions,CN=Configuration,", "msExchAcceptedDomain", "msDS-DelegatedManagedServiceAccount", "msDS-ManagedAccountPrecededByLink")
| project
    TimeGenerated,
    Computer,
    Account,
    AccountType,
    Activity,
    OperationType,
    EventData,
    SubjectLogonId