// Source: https://github.com/rod-trent/SentinelKQL
// Collected: 2026-05-14
// KQL Library - https://github.com/sivolko/kql-library

OfficeActivity
| where TimeGenerated > ago(2h)
| summarize count()
| where count_ == 0