// Source: https://github.com/sivolko/kql-library
// Collected: 2026-05-13
// KQL Library - https://github.com/sivolko/kql-library

IdentityLogonEvents 
| where FailureReason == "WrongPassword"
| where AccountName !has "$"
| where Application == "Active Directory"
| summarize totalbadpassword =  count() by DeviceName
| sort by totalbadpassword  desc 