// Source: https://github.com/SheriffBLN/defender-lab-framework
// Collected: 2026-05-17
// KQL Library - https://github.com/sivolko/kql-library

DeviceEvents
| where ActionType == "UserAccountCreated"
| project Timestamp, DeviceName, ReportId, InitiatingProcessAccountName, InitiatingProcessCommandLine, AdditionalFields
| order by Timestamp desc