// Source: https://github.com/rod-trent/Security-Copilot
// Collected: 2026-05-10
// KQL Hunter - https://github.com/YOUR_USER/kql-hunter

AzureActivity
| where OperationNameValue == "MICROSOFT.SECURITYCOPILOT/REGISTER/ACTION"
| project Caller, CallerIpAddress, ResourceGroup