// Source: https://github.com/chadmcox/Sentinel-and-Defender-Queries
// Collected: 2026-05-11
// KQL Library - https://github.com/sivolko/kql-library

let list = IdentityInfo
| where Tags contains "Sensitive"
| distinct OnPremSid;
IdentityLogonEvents 
| where AccountSid in (list)
| project AccountDomain, AccountName, DestinationDeviceName