// Source: https://github.com/reversinglabs/reversinglabs-siem-rules
// Collected: 2026-05-15
// KQL Library - https://github.com/sivolko/kql-library

let c2ips = external_data(c2ip: string) [h"https://raw.githubusercontent.com/reversinglabs/reversinglabs-siem-rules/master/Malware/NetsupportRAT/20231016/KQL/netsupportrat-20231016-c2ips.txt"];
let c2domains = external_data(c2domain: string) [h"https://raw.githubusercontent.com/reversinglabs/reversinglabs-siem-rules/master/Malware/NetsupportRAT/20231016/KQL/netsupportrat-20231016-c2domains.txt"];
let NetSupportUserAgent = "NetSupport Manager";
CommonSecurityLog
| where DestinationIP in (c2ips)
  or DestinationHostName in (c2domains)
  or RequestClientApplication contains NetSupportUserAgent
| union 
(DeviceNetworkEvents
| where RemoteIP in (c2ips)
),
(SysmonParser
| where (EventID == 3 and DestinationIp in (c2ips)))