// Source: https://github.com/microsoft/AzureMonitorCommunity
// Collected: 2026-05-14
// KQL Library - https://github.com/sivolko/kql-library

SecurityEvent
| where EventID == 4624
| summarize LogonCount = count() by Account