// Source: https://github.com/Cameloo1/sharepoint-toolshell-micro-postmortem
// Collected: 2026-05-15
// KQL Library - https://github.com/sivolko/kql-library

SecurityEvent
| where EventID == 4688
| where ParentProcessName has "\\w3wp.exe"
| where NewProcessName has "\\powershell.exe"
| where CommandLine has_any ("-enc","-EncodedCommand")
| project TimeCreated=TimeGenerated, Account, Computer, ParentProcessName, NewProcessName, CommandLine
| order by TimeCreated desc
