// Source: https://github.com/Azure/ausgovcaf-cloudsoe
// Collected: 2026-05-12
// KQL Library - https://github.com/sivolko/kql-library

SecurityEvent 
| where EventID == 4625
| where Status =~ "0xC000006D"
| summarize BadLogins = count() by TargetAccount, WorkstationName
| sort by BadLogins