// Source: https://github.com/ge0mant1s/SOaC-Enterprise
// Collected: 2026-05-18
// KQL Library - https://github.com/sivolko/kql-library

SecurityEvent | where TimeGenerated >= ago(7d) | where EventID in (4624, 4625, 4648) | where LogonType == 3 | where Account contains "HealthMailbox" or Account contains "FederatedEmail" | where ProcessName contains "w3wp.exe" or ProcessName contains "MSExchangeOWAAppPool" | where SubjectUserName != Account | project TimeGenerated, Computer, Account, ProcessName, IpAddress, LogonType, EventID | summarize count() by Computer, Account, IpAddress | where count_ > 10