// Source: https://github.com/SlimKQL/Hunting-Queries-Detection-Rules
// Collected: 2026-05-12
// KQL Library - https://github.com/sivolko/kql-library

DeviceEvents
| where Timestamp > ago(1h)
| where ActionType == "DnsQueryResponse"
| extend QueryName = tolower(tostring(parse_json(AdditionalFields)["DnsQueryString"]))
| where QueryName endswith "-com.mail.protection.outlook.com"