// Source: https://github.com/rod-trent/Sentinel-SOC-101
// Collected: 2026-05-16
// KQL Library - https://github.com/sivolko/kql-library

SecurityEvent  
| where EventID == 4624 and TargetLogonId != 0x0 and IpAddress == "<source IP address>"  
| extend LegacyAuthentication = iif((LogonProcessName =~ "Advapi" or LogonProcessName =~ "Ssp"), "True", "False")  
| where LegacyAuthentication == "True"