// Source: https://github.com/chadmcox/Sentinel-and-Defender-Queries
// Collected: 2026-05-12
// KQL Library - https://github.com/sivolko/kql-library

let list = IdentityInfo
| where Tags contains "Sensitive"
| distinct OnPremSid;
IdentityLogonEvents 
| where Protocol !in ('NTLM','Kerberos')
| where LogonType == 'LDAP cleartext'
| where AccountSid in (list)
| distinct AccountDisplayName, DeviceName, AccountDomain, LogonType