// Source: https://github.com/sivolko/kql-library
// Collected: 2026-05-15
// KQL Library - https://github.com/sivolko/kql-library

ThreatIntelligenceIndicator
| where SourceSystem == "DugganUSA-STIX-Feed"
| where TimeGenerated > ago(6h)
| where ThreatType == "c2"
| join kind=inner (
    CommonSecurityLog
    | where TimeGenerated > ago(24h)
) on $left.NetworkIP == $right.DestinationIP
| project TimeGenerated, SourceIP, DestinationIP, ThreatType, Description, Confidence